---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeStructure
source: html/5ac59a63-16a4-1eb3-76e8-c37e5d5e3286.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeStructure Property

"Structure": Structure

## Syntax (C#)
```csharp
public static ForgeTypeId StairsLandingtypeStructure { get; }
```